/*************************************************************************************
*文件名称：探测概率模型                                                              *
*作    者：                                                                          *
*版    本：                                                                          *
*日    期：                                                                          *
*功能描述：本程序为卫星探测概率模型，用于计算卫星对目标的探测概率。                  *
*输    入：该程序为多输入，输入为最小信噪比阈值、实际信噪比以及虚警概率。            *
*输    出：该程序为单输出，输出为卫星对目标的探测概率。                              *
*函数列表：1.getProbability()——用于计算卫星对目标的探测概率。                      *
*历    史：                                                                          *
*                   Copyright (c) wangchong. All Rights Reserved                     *
*************************************************************************************/

#include "Probability.h"
#include <cmath>

Probability::Probability()
{
}


Probability::~Probability()
{

}

/*************************************************************************************
* 描述：getProbability()函数用于计算卫星对目标的探测概率，输入为最小信噪比阈值snr、实*                                                                             *
*       际信噪比SNR和虚警概率pj，输出为卫星对导弹的探测概率P。                       *
*************************************************************************************/
double Probability::getProbability(double SNR, double pj)                          //计算卫星对目标的探测概率
{
	double a = -2 * log(pj);
	double b = sqrt(a);
	double c = (5 * SNR / 15 - b);
	double P = 0.5 * erfc(- c / sqrt(2));         //利用标准正态分布计算探测概率
	
	return P;
}
